# <font color="blue"><h3 align="center">Pandas Merge and join </h3></font>

In [24]:
import pandas as pd
df1 = pd.DataFrame({
    "Col1": ["a","b","c"],
    "Col2": [1,2,3],
})

df1

  Col1  Col2
0    a     1
1    b     2
2    c     3

In [25]:
df2 = pd.DataFrame({
    "Col1": ["a","b","d", "e"],
    "Col2": [1,2,3, 4],
    "Col3": [4,5,6, 7],
})

df2

  Col1  Col2  Col3
0    a     1     4
1    b     2     5
2    d     3     6
3    e     4     7

Use <b>merge</b>, which is inner join by default:

In [26]:
# merge by using common column 'Col1'
df3 = pd.merge(df1, df2, on="Col1")
df3

  Col1  Col2_x  Col2_y  Col3
0    a       1       1     4
1    b       2       2     5

In [27]:
# merge using index
df3 = df1.merge(df2)
df3

  Col1  Col2  Col3
0    a     1     4
1    b     2     5

In [28]:
# merge using multi column
df3 = df1.merge(df2, on=['Col1', 'Col2'])
df3

  Col1  Col2  Col3
0    a     1     4
1    b     2     5

## Join

<b>join</b>, which is left join by default, it join a column in the left data frame to the index of the right data frame.
Turn learn more about a command in jupyter notebook, press shift tab pn the current function

In [32]:
df3= df2.join(df2, on='Col2', rsuffix='_df2')
df3

  Col1  Col2  Col3 Col1_df2  Col2_df2  Col3_df2
0    a     1     4        b       2.0       5.0
1    b     2     5        d       3.0       6.0
2    d     3     6        e       4.0       7.0
3    e     4     7      NaN       NaN       NaN

In [33]:
# Example of right join
df3= df2.join(df2, on='Col2', how='right', rsuffix='_df2')
df3

  Col1  Col2  Col3 Col1_df2  Col2_df2  Col3_df2
0    a     1   4.0        b         2         5
1    b     2   5.0        d         3         6
2    d     3   6.0        e         4         7
3  NaN     0   NaN        a         1         4

## Concatenate

Or concat, which is outer join by default:

In [31]:
df3=pd.concat([df1, df2], axis=1)
df3

  Col1  Col2 Col1  Col2  Col3
0    a   1.0    a     1     4
1    b   2.0    b     2     5
2    c   3.0    d     3     6
3  NaN   NaN    e     4     7

## Concatenate

In [64]:
df4 = pd.DataFrame({
    "Col1": ["a","b","d", "e"],
    "Col2": [1,6,53, 14],
    "Col3": [4,15,16, 17],
})

  Col1  Col2  Col3
0    a     1     4
1    b     6    15
2    d    53    16
3    e    14    17